app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @article = Article.find params[:id]

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hfjhhj"], ["text", "jhjhgjghj"], ["created_at", "2019-01-13 00:30:17.146615"], ["updated_at", "2019-01-13 00:30:17.146615"]]
---
  def create
    # render plain: params[:article].inspect
    # @article = Article.new(params[:article])
    #
    # @article.save
    # redirect_to @article


    @article = Article.new(article_params)

    if @article.save