app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("breadtype", "ingredient", "vegetable", "condiment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["breadtype", "White bread"], ["ingredient", ""], ["vegetable", "Tomato"], ["condiment", ""], ["created_at", "2019-01-21 22:29:55.486271"], ["updated_at", "2019-01-21 22:29:55.486271"]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "breadtype" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["breadtype", "Rye bread"], ["updated_at", "2019-02-02 14:35:22.441188"], ["id", 16]]