app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all.map{ |c| [ c.name, c.id ] }

INSERT INTO "products" ("name", "vegan", "category_id", "created_at", "updated_at", "desc") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sadasd"], ["vegan", 1], ["category_id", "5"], ["created_at", "2019-02-02 13:07:50.806219"], ["updated_at", "2019-02-02 13:07:50.806219"], ["desc", "sadasdyxdydx"]]
---
  def create
    @product = Product.new(product_params)
    @product.category_id = params[:category_id]

    respond_to do |format|
      if @product.save

UPDATE "products" SET "vegan" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["vegan", 0], ["updated_at", "2019-02-02 13:16:34.511515"], ["id", 12]]
---
  def update
    respond_to do |format|
      @product.category_id = params[:category_id]
      if @product.update(product_params)