app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "asd"], ["image", "#<ActionDispatch::Http::UploadedFile:0x00007f074da3e9d0>"], ["created_at", "2019-02-01 23:33:19.407344"], ["updated_at", "2019-02-01 23:33:19.407344"]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "image" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["image", nil], ["updated_at", "2019-02-01 23:38:55.029196"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @review.update(review_params)