app/views/categories/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", "1"]]
---
<h3> Products under this category </h3>
<% Product.where(category_id: @category.id).each do |product| %>