app/views/products/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        </td>
        <td><%= link_to Category.find(product.category_id).name, category_path(product.category_id) %></td>