app/views/products/index.html.erb

  <div class="col-sm-4"><%= product.desc %></div>
  <div class="col-sm-3"><%= link_to Category.find(product.category_id).name, category_path(product.category_id) %></div>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]