app/views/products/show.html.erb

  <strong>Category:</strong>
  <%= link_to Category.find(@product.category_id).name, category_path(@product.category_id) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]